In [53]:
import pandas as pd
import numpy as np

In [7]:
df = pd.read_csv('ex1.txt')

In [8]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
pd.read_table('ex1.txt',sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
pd.read_csv('ex2.txt',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [14]:
pd.read_csv('ex2.txt',names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [15]:
names=['a','b','c','d','message']

In [17]:
pd.read_csv('ex2.txt',names=names,index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [21]:
parsed = pd.read_csv('csv_mindex.txt',index_col=['key1','key2'])

In [28]:
list(open('ex3.txt'))

["'            A         B         C',\n",
 " 'aaa -0.264438 -1.026059 -0.619500,\n",
 " 'bbb  0.927272  0.302904 -0.032399,\n",
 " 'ccc -0.264273 -0.386314 -0.217601,\n",
 " 'ddd -0.871858 -0.348382  1.100491,"]

In [29]:
result = pd.read_table('ex3.txt', sep='\s+')

In [30]:
result

      '         A         B         C',
0  'aaa -0.264438 -1.026059  -0.619500,
1  'bbb  0.927272  0.302904  -0.032399,
2  'ccc -0.264273 -0.386314  -0.217601,
3  'ddd -0.871858 -0.348382   1.100491,

In [31]:
list(open('ex4.txt'))

['a,b,c,d,message\n', '1,2,3,4,hello\n', '5,6,7,8,world\n', '9,10,11,12,foo']

In [34]:
pd.read_csv('ex4.txt')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [36]:
result = pd.read_csv('ex5.txt')

In [37]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [38]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [39]:
result = pd.read_csv('ex5.txt',na_values=['NULL'])

In [40]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [41]:
pd.options.display.max_rows = 10

In [42]:
data = pd.read_csv('ex5.txt')

In [43]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [45]:
data.to_csv('out.csv')

In [49]:
!type out.csv
,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

SyntaxError: invalid syntax (<ipython-input-49-a6e1cb72ecf2>, line 4)

In [50]:
data = pd.date_range('1/1/2000',periods=7)

In [51]:
data

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [55]:
ts = pd.Series(np.arange(7),index=data)

In [56]:
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [58]:
!type examples\tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

SyntaxError: invalid token (<ipython-input-58-46e55fa6b090>, line 3)

In [59]:
import csv

In [60]:
f = open('ex7.txt')

In [63]:
reader = csv.reader(f)

In [64]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [65]:
with open('ex7.txt') as f:
    lines = list(csv.reader(f))

In [66]:
header,values = lines[0],lines[1:]

In [67]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [70]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [73]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL
reader = csv.reader(f, delimiter='|')

TypeError: argument 1 must be an iterator

In [74]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

In [75]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [76]:
import json
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [77]:
asjson = json.dumps(result)

In [78]:
 siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [79]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [80]:
frame = pd.read_csv('ex1.txt')

In [81]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [82]:
frame.to_pickle('frame_pickle')

In [83]:
pd.read_pickle('frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [86]:
xlsx = pd.ExcelFile('Sheet1.xlsx')

In [87]:
pd.read_excel(xlsx, 'Sheet1')

    a   b   c   d  message
0   1   2   3   4    hello
1   5   6   7   8    world
2   9  10  11  12      yes
3  13  14  15  16      wow
4  17  18  19  20  awesome

In [91]:
 frame = pd.read_excel('xlsx''Sheet1')

FileNotFoundError: [Errno 2] No such file or directory: 'xlsxSheet1'